README.org
* SmoothMoves-Frontend
Please see the README of the backend portion of this webapp for more details regarding this fullstack web app:
- https://github.com/SamuelBanya/SmoothMoves/blob/main/README.md

* Installation Instructions
Run the following command within the repo's local directory to install its components:
#+begin_src bash
npm install
#+end_src

Run the frontend with this command:
#+begin_src bash
npm start
#+end_src
