README.md

# Table of Contents

1.  [SmoothMoves-Frontend](#org2025904)
2.  [Installation Instructions](#orgb02e6b1)


<a id="org2025904"></a>

# SmoothMoves-Frontend

Please see the README of the backend portion of this webapp for more details regarding this fullstack web app:

-   <https://github.com/SamuelBanya/SmoothMoves/blob/main/README.md>


<a id="orgb02e6b1"></a>

# Installation Instructions

Run the following command within the repo's local directory to install its components:

    npm install

Run the frontend with this command:

    npm start
